{
  "traces": [],
  "train": [],
  "demos": [],
  "signature": {
    "instructions": "Assess overall ski conditions across all candidates for the target date.\n\nCreates shared context for scoring - prevents redundant per-mountain reasoning.\n\n## Output Format\nReturn exactly three fields:\n\n1. **day_quality**: Must be one of ['excellent', 'fair', 'poor', 'stay_home']. Do not use 'good' or other variations.\n   - 'excellent': Premium conditions with significant fresh snow (10\"+), cold stable temperatures, light winds, good visibility\n   - 'fair': Moderate conditions with some snow (even 5-6\"), acceptable temperatures/winds, or decent conditions for casual/intermediate skiers. Include days where fresh snow exists but wind/visibility creates suboptimal powder experience for advanced skiers\n   - 'poor': Marginal conditions with minimal snow (0-2\"), warm temperatures (35°F+), or severe weather that makes skiing unenjoyable\n   - 'stay_home': Extremely poor conditions not worth skiing (no snow, dangerous weather, etc.)\n\n2. **best_available**: Concise summary (1-2 sentences) identifying the top mountain and why it stands out relative to other candidates\n\n3. **day_context**: Multi-sentence assessment of regional conditions patterns. Analyze:\n   - Snow accumulation distribution across candidates (compare amounts)\n   - Temperature patterns (especially elevation gradients and impact on snow preservation)\n   - Wind conditions (light = <10 mph, moderate = 10-20 mph, strong = 20+ mph)\n   - Visibility consistency across mountains\n   - Weather stability implications\n   - How conditions serve the user's skill level and vibe preference\n\n## Key Domain Facts\n- Cold stable temperatures (especially sub-25°F) preserve fresh snow structure and support longer powder day windows\n- Light winds (<10 mph) are ideal; 10-20 mph is manageable; 20+ mph degrades experience\n- Significant regional snowfall (8\"+ across multiple resorts) creates premium conditions warranting 'excellent'\n- 5-6\" of fresh snow constitutes meaningful accumulation that supports 'fair' conditions, even if not ideal for all user types\n- Elevation differences typically produce 2-4°F temperature gradients between resorts\n- Good visibility indicates clearing or stable weather patterns\n- Powder chasers (advanced skiers) prioritize fresh snow depth and thermal stability, and may rate conditions lower if wind/visibility compromise the experience despite adequate snow\n- Intermediate/casual skiers benefit from fresh snow (even 5-6\") and can tolerate moderate winds (10-20 mph) and fair visibility better than advanced powder skiers\n- Temperatures above 35°F significantly degrade snow quality and create poor skiing conditions\n- Zero fresh snow with warm temperatures (35°F+) should be rated 'poor'\n- 5-6\" fresh snow with cold temperatures is typically 'fair' even if other factors (wind, visibility) are suboptimal for specific user preferences\n\n## Scoring Strategy\nCompare all candidates systematically before making day_quality judgment. Identify the mountain with the best combination of factors for the given user preference. Use the regional context assessment to calibrate whether conditions are truly excellent (rare premium day) vs fair (more common, workable conditions with some limitations) vs poor (marginal or unenjoyable). \n\nCritical calibration rules:\n- Presence of 5-6\" fresh snow with cold temperatures generally warrants 'fair' or better, not 'poor', unless zero fresh snow or warm temps exist\n- A powder-chaser user may find conditions suboptimal (write this in best_available/day_context) but still rate day_quality as 'fair' if the objective conditions (snow accumulation + temperature) support skiing\n- Only use 'poor' when snow accumulation is very low (0-2\") OR temperatures are warm (35°F+) OR visibility/wind make conditions genuinely unenjoyable\n- 'stay_home' is reserved for extreme safety/enjoyability concerns",
    "fields": [
      {
        "prefix": "All Candidates:",
        "description": "JSON of all candidates with conditions"
      },
      {
        "prefix": "User Preferences:",
        "description": "Parsed preferences from query"
      },
      {
        "prefix": "Day Quality:",
        "description": "excellent/good/fair/poor/stay_home"
      },
      {
        "prefix": "Best Available:",
        "description": "Key fact: e.g. 'Stowe has 15\" fresh, everyone else <5\"'"
      },
      {
        "prefix": "Day Context:",
        "description": "Notable factors: wind, temp, visibility patterns across region"
      }
    ]
  },
  "lm": null,
  "metadata": {
    "dependency_versions": {
      "python": "3.10",
      "dspy": "3.0.4",
      "cloudpickle": "3.1"
    }
  }
}
