{
  "traces": [],
  "train": [],
  "demos": [],
  "signature": {
    "instructions": "Score a single mountain given conditions, preferences, and day context to help skiers decide whether to visit.\n\n## Scoring Framework\n\n**Base Score (0-100)**: Start with 50 as neutral baseline.\n\n**Key Scoring Factors:**\n- Fresh snow in last 24h: Most heavily weighted factor for powder_chase vibe. 14\"+ = +25, 8-13\" = +20, 4-7\" = +10, 0-3\" = 0-5\n- Temperature preservation: Cold temps (<25°F) preserve powder quality (+5 bonus), warm temps (>35°F) degrade conditions (-10 penalty for powder vibe)\n- Terrain match to user vibe and skill level:\n  * powder_chase: glades and double_black terrain critical, require presence and appropriate difficulty\n  * family_day: green % and learning area quality critical, beginner terrain essential\n  * For advanced skiers: black/double_black % and glade availability more valuable\n  * For intermediate skiers: blue % and terrain parks more valuable\n- Pass compatibility: Major incompatibility (-15 to -20 points). Epic-only mountains penalize Ikon holders; Ikon-only penalize Epic holders\n- Drive time: <90 min = no penalty, 90-150 min = -5, 150-200 min = -10, >200 min = -15 (higher impact on \"fair\" quality days)\n- Lift infrastructure context boost: Gondolas provide warming/recovery benefit on cold days (+3), superpipe/parks matter for park vibes\n- Snowmaking %: Matters more on dry days (low fresh snow); 85%+ = +5 bonus on low powder days\n- Wind impact: Glades suffer in high wind (>15 mph), visibility/safety concerns compound\n\n**Contextual Boosts/Penalties:**\n- Exceptional snow differential vs. region: If this mountain significantly outperforms peers in fresh snow, boost score (+10-15)\n- Day quality modifier: \"excellent\" day can push high-potential mountains to 85+; \"fair\" day caps most mountains at 65-70 unless they uniquely excel\n- Weather-to-terrain matching: Light snow + glades = synergistic (+5); warm temps + pow vibe = contradictory (-10)\n\n**Final Score Calibration:**\n- 85+: Exceptional choice, strong recommendation despite tradeoffs\n- 75-84: Very good option, clear advantages for this user/day\n- 65-74: Solid option, some meaningful compromises\n- 50-64: Marginal option, significant tradeoffs\n- <50: Poor fit, not recommended\n\n**CRITICAL CALIBRATION NOTES:**\n- On \"fair\" quality days (no regional snow advantage, warm temps, low powder appeal), powder-chase mountains without fresh snow should score 45-55 range, not higher. Drive time compounds this penalty significantly.\n- Missing critical terrain for the user's vibe (e.g., no glades for powder_chase, no green terrain for family_day) should result in substantial penalties even with other positive factors. This can push scores down 15-25 points from base.\n- Pass incompatibility is a dealbreaker and should weigh heavily enough that the tradeoff_note acknowledges it as potentially preventing the visit unless day-ticket alternatives exist.\n- Score 28 example: When user vibe (powder_chase + advanced + glades required) is completely mismatched with mountain terrain (zero glades, zero double_black, minimal vertical, only 2\" fresh), the score should reflect this fundamental incompatibility even with positive logistics (close drive, 100% snowmaking, night skiing). The mountain is \"not recommended\" territory.\n- Score 52 example: A mountain with excellent glade terrain still scores only marginally (52) on a fair day with 0\" fresh snow and warm 38°F temps because: (1) zero fresh snow kills powder_chase appeal, (2) warm temps cause afternoon degradation, (3) long drive (2h 45m) isn't justified for fair-quality conditions. The user would be better served waiting for better conditions or finding a closer alternative.\n\n## Output Format\n\n**score**: Single numeric value (0-100), reflecting weighted reasoning above\n\n**key_pros**: 2-3 specific advantages tied directly to user preferences, conditions, and terrain (quantify where possible: \"14\" fresh\", \"48\" base\", \"32% green\")\n\n**key_cons**: 2-3 specific disadvantages tied to conditions, user preferences, or drive time (quantify: \"only 4\" fresh\", \"38°F temps\", \"2h 45m drive\")\n\n**tradeoff_note**: Concise summary of the core decision for this user on this day (e.g., \"Best powder in region but requires 3h drive and incompatible pass\" or \"Family-friendly backup but sacrifices exceptional pow day elsewhere\"). Acknowledge competing priorities and whether the user should pursue this mountain or seek alternatives.\n\n## Domain Context\n\n- Powder-chase skiers prioritize fresh snow and glade terrain heavily; warm temps and tracked-out conditions are major negatives\n- Family-day skiers prioritize beginner terrain, learning areas, and reliability; drive time is higher cost\n- Advanced skiers value glade difficulty, double-black %, and fresh snow; intermediate skiers value blue terrain variety and parks\n- Regional context matters: if one mountain has 14\" and all others <5\", that mountain gets significant boost for powder vibes\n- Warm temps (>35°F) will cause afternoon slush and condition degradation, especially damaging to powder-chase appeal\n- Drive time compounds negatively on \"fair\" quality days (low ROI) but is justified on \"excellent\" days with standout conditions\n- Missing critical terrain types for a user's stated vibe/needs (null values or 0% availability) is a fundamental disqualifier and should heavily penalize scores\n- On fair-quality snow days with no regional snow advantage, mountains without the specific terrain user needs should not be overscored based on amenities or logistics alone",
    "fields": [
      {
        "prefix": "Mountain:",
        "description": "Mountain data with current conditions"
      },
      {
        "prefix": "User Preferences:",
        "description": "Parsed preferences from query"
      },
      {
        "prefix": "Day Context:",
        "description": "Overall day quality and mode"
      },
      {
        "prefix": "Score:",
        "description": "0-100 appeal score"
      },
      {
        "prefix": "Key Pros:",
        "description": "Top 2-3 reasons to go here"
      },
      {
        "prefix": "Key Cons:",
        "description": "Top 1-2 drawbacks"
      },
      {
        "prefix": "Tradeoff Note:",
        "description": "Notable tradeoff, e.g. 'best snow but longest drive'"
      }
    ]
  },
  "lm": null,
  "metadata": {
    "dependency_versions": {
      "python": "3.10",
      "dspy": "3.0.4",
      "cloudpickle": "3.1"
    }
  }
}
